In [31]:
import pandas as pd
import numpy as np

###

### Data:

        1. Qualitative  -  Non Numerical
        2. Quantitative  -  Numerical

###

### Qualitative:
    
            1. Nominal
            2. Ordinal


1. Nominal: 

            - Named i.e. can not be put in an order / Can't be ordered
            - ex: Gender, FuelType, Name, Address

2. Ordinal:

            - In a natural order i.e. can not be rearranged
            - Already present in an order
            - ex: Grade, Rank, Days

###

### Quantitative:

            1. Discrete
            2. Continuous

1. Discrete:

            - Any column that contains numbers in the form of intergers
            - Values displayed / visualised using bar graphs
            - Ex: 23, 45, 67, 34, 35 etc...

2. Continuous:

            - Any column that contains numbers in the form of real values
            - Values displayed / visualised using histogram
            - Ex: 23.45, 67.78 etc...

###

In [32]:
dict1 = {
    'name' : ['Amit', 'Rahul', 'Shail','?'],
    'Roll' : [2014, 3455, '??', '4567'],
    'Bday' : ['21-05-2020', '???', '21-07-2020', '23-09-2020']
}

In [33]:
df = pd.DataFrame(dict1)
df

    name  Roll        Bday
0   Amit  2014  21-05-2020
1  Rahul  3455         ???
2  Shail    ??  21-07-2020
3      ?  4567  23-09-2020

In [34]:
df.to_csv('mysample.csv')

In [35]:
df.head()

    name  Roll        Bday
0   Amit  2014  21-05-2020
1  Rahul  3455         ???
2  Shail    ??  21-07-2020
3      ?  4567  23-09-2020

In [36]:
df1 = pd.read_csv('Toyota.csv')
df1

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...,...
1431,1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [37]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1436 non-null   int64
 1   Price       1436 non-null   int64
 2   Age         1336 non-null   float64
 3   KM          1436 non-null   object
 4   FuelType    1336 non-null   object
 5   HP          1436 non-null   object
 6   MetColor    1286 non-null   float64
 7   Automatic   1436 non-null   int64
 8   CC          1436 non-null   int64
 9   Doors       1436 non-null   object
 10  Weight      1436 non-null   int64
dtypes: float64(2), int64(5), object(4)
memory usage: 123.5+ KB

In [38]:
df1.head()

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170

###

### na_values

- Specified values will be given NaN
- Arguments are given in a list or a dictionary

In [39]:
df = pd.read_csv('mysample.csv')
df

   Unnamed: 0   name  Roll        Bday
0           0   Amit  2014  21-05-2020
1           1  Rahul  3455         ???
2           2  Shail    ??  21-07-2020
3           3      ?  4567  23-09-2020

In [40]:
df = pd.read_csv('mysample.csv', na_values=['?', '??', '???', '????'])
df

   Unnamed: 0   name    Roll        Bday
0           0   Amit  2014.0  21-05-2020
1           1  Rahul  3455.0         NaN
2           2  Shail     NaN  21-07-2020
3           3    NaN  4567.0  23-09-2020

###

### value_counts()

- Tells all distinct values in the given column

### parse_dates

- Keep the datatype (datetime) of given date column same

### index_col

- Will change the starting column based on the given argument

In [41]:
df['name'].value_counts()

name
Amit     1
Rahul    1
Shail    1
Name: count, dtype: int64

In [46]:
df = pd.read_csv('mysample.csv',na_values = {'name' : 'Amit', 'Roll' : 4567, 'Bday' : '23-09-2020'}, index_col = 0)
df

    name  Roll        Bday
0    NaN  2014  21-05-2020
1  Rahul  3455         ???
2  Shail    ??  21-07-2020
3      ?   NaN         NaN

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   Roll    3 non-null      object
 2   Bday    3 non-null      object
dtypes: object(3)
memory usage: 128.0+ bytes